import React from "react";
import { Link } from "react-router-dom";
import "../styles/PolicyStyles.css";

import { useAuth } from "../context/auth";

const Policy = () => {
  const [auth, setAuth] = useAuth();
  return (
    <div className="wrapper">
      <div className="policyCtn">
        <div className="policyBody">
          <div className="title">
            <h3>Privacy Policy</h3>
          </div>
          <div className="textBlock">
            Ця Політика конфіденційності пояснює, як ми збираємо,
            використовуємо, розкриваємо та захищаємо вашу інформацію, коли ви
            користуєтеся нашим сайтом для бронювання ліків. Ми прагнемо
            забезпечити конфіденційність та безпеку всієї інформації, яку ви
            надаєте нам. Будь ласка, ознайомтесь з цією політикою, щоб розуміти,
            як ми працюємо з вашими даними.
          </div>

          <div className="title">
            <h3>Збір і використання інформації</h3>
          </div>
          <div className="textBlock">
            Ми збираємо різну інформацію, коли ви взаємодієте з нашим сайтом для
            бронювання ліків. Ця інформація може включати ваше ім'я, адресу
            електронної пошти, контактні дані та іншу відповідну інформацію,
            необхідну для обробки вашого замовлення. Ми використовуємо надану
            вами інформацію для таких цілей:
            <ul>
              <li>Обробка та виконання вашого замовлення ліків.</li>
              <li>
                Забезпечення зв'язку з вами щодо вашого замовлення та надання
                пов'язаних послуг.
              </li>
              <li>
                Зв'язок з вами щодо вашого замовлення, запитів або пов'язаних
                питань.
              </li>
              <li>
                Покращення нашого сервісу та персоналізація ваших досвідів.
              </li>
            </ul>
          </div>

          <div className="title">
            <h3>Розкриття інформації</h3>
          </div>
          <div className="textBlock">
            Ми дотримуємося принципу конфіденційності та не розкриваємо вашу
            інформацію третім особам без вашої згоди, за винятком випадків,де це
            необхідно з медичних або правових причин. Ми можемо розкривати вашу
            інформацію таким особам або організаціям:
            <ul>
              <li>
                Медичним фахівцям та спеціалістам, які безпосередньо займаються
                обробкою вашого замовлення та наданням медичних послуг.
              </li>
              <li>
                Постачальникам послуг, які співпрацюють з нами для забезпечення
                технічної підтримки, зберігання даних та інших необхідних
                послуг.
              </li>
              <li>
                ЗУповноваженим органам, якщо ми вважаємо, що таке розкриття
                необхідне з медичних або правових причин, включаючи відповідь на
                запити від уповноважених органів.
              </li>
            </ul>
            Ми робимо все можливе, щоб забезпечити безпеку та конфіденційність
            вашої інформації при розкритті третім особам. Ми укладаємо
            відповідні угоди та вимагаємо від третіх осіб застосування належних
            заходів безпеки для захисту вашої інформації.
          </div>

          <div className="title">
            <h3>Зміна або вилучення інформації</h3>
          </div>
          <div className="textBlock">
            Ви маєте право змінювати або вилучати вашу інформацію, яку ви надали
            нам. Якщо ви бажаєте оновити або вилучити ваші дані, будь ласка,
            зв'яжіться з нами за допомогою наданої контактної інформації, і ми
            зробимо все можливе, щоб задовольнити ваш запит.
          </div>

          <div className="title">
            <h3>Зберігання та захист інформації</h3>
          </div>
          <div className="textBlock">
            Ми зберігаємо вашу особисту і медичну інформацію протягом
            необхідного періоду, необхідного для виконання цілей, зазначених у
            цій політиці конфіденційності. Ми дотримуємося відповідних технічних
            та організаційних заходів безпеки для запобігання несанкціонованому
            доступу, втраті, використанню або розголошенню інформації. Ми
            приймаємо ряд заходів безпеки для захисту вашої інформації,
            включаючи використання шифрування даних, фізичних та логічних
            заходів безпеки, контроль доступу до інформації та обмеження доступу
            до інформації тільки для необхідних працівників з метою виконання
            їхніх обов'язків. Проте, ви повинні розуміти, що ніяка методика
            передачі даних через Інтернет або електронне зберігання не є 100%
            безпечною. Ми не можемо гарантувати абсолютну безпеку вашої
            інформації.
          </div>

          <div className="title">
            <h3>Зміни до політики конфіденційності</h3>
          </div>
          <div className="textBlock">
            Ми можемо періодично оновлювати цю політику конфіденційності,
            затримуючи дату її останнього оновлення. Будь ласка, періодично
            переглядайте цю політику, щоб бути в курсі наших практик збору,
            використання та захисту вашої інформації.
          </div>

          <div className="title">
            <h3>Зв'язок з нами</h3>
          </div>
          <div className="textBlock">
            Якщо у вас виникли будь-які питання або зауваження щодо цієї
            політики конфіденційності або використання вашої інформації, будь
            ласка, зв'яжіться з нами за допомогою контактної інформації,
            наведеної на нашому веб-сайті.
          </div>

          <div className="policyFooter">
            <div className="timeStamps">
              Востаннє оновлено: 20 травня 2023 року
            </div>
            <div className="returnBtn">
              {auth?.user ? (
                <Link to="/home">
                  <button>Повернутись</button>
                </Link>
              ) : (
                <Link to="/">
                  <button>Повернутись</button>
                </Link>
              )}
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Policy;
